#include<stdio.h>
int
main ()
{
  int a, b;

  //scanf("%d%d", &a, &b);
  //这个每办法，我只能直接分析！
  //这里展示的是ｂｉｔ级别的合并与分离
  int i, j;
  for (i = 0; i < 2; i++)
    {
      for (j = 0; j < 2; j++)
	{
	  a = i, b = j;

	  //从运算率角度解释就是b=(a^b)^b=a^(b^b)=a^0=a
	  //我觉得自己打印出来的东西，也要一眼可以看到程序想表达的东西，这里
	  //我在不断调整，程序所打印出来的东西！
	  printf ("(a=%d,b=%d)\ta=a^b=%d^%d=%d\n", a, b, a, b, a ^ b);
	  a = a ^ b;		//合并ａ与ｂ
	  printf ("(a=%d,b=%d)\n\n", a, b);

	  printf ("(a=%d,b=%d)\tb=a^b=%d^%d=%d\n", a, b, a, b, a ^ b);
	  b = a ^ b;		//这里ａ是ａｂ合并后的值，ｂ是ｂ变量的初始值，两者＾得到的是ａ
	  printf ("(a=%d,b=%d)\n\n", a, b);

	  printf ("(a=%d,b=%d)\ta=a^b=%d^%d=%d\n", a, b, a, b, a ^ b);

	  //从运算率角度解释就是a=(a^b)^a=a^(a^b)=(a^a)^b=0^b=b
	  //这样一来，打印也没有什么价值的！
	  //从合并与分离角度谈，如果ａｂ同为零，则合并后为零，零＾ａ＝ｂ，零＾ｂ＝ａ，可以轻松实现分离．
	  //如果ａｂ相反，则合并后为１，１＾ａ＝ｂ，１＾ｂ＝ａ，可以轻松实现分离
	  //如果ａｂ同为一，则合并后为０，０＾ａ＝ｂ，０＾ｂ＝ａ，也可以轻松实现分离！
	  a = a ^ b;//这里ａ依然是合并值，但是ｂ确实变化后的值，这里的ｂ是ａ变量的初始值！
	  printf ("(a=%d,b=%d)\n--------------------------\n", a, b);
	}
    }
  //printf ("%d %d\n", a, b);

  //好了,总算有了较好的理解！
  return 0;
}
